<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=utf-8">
	<TITLE>VDManager - Analízis modell</TITLE>
	<style type="text/css">
	body {
		max-width: 1000px;
		min-width: 800px;
		margin: auto;
		padding: 10px;
	}
	p {
		text-align: justify;
	}
	p.center {
		text-align: center;
	}

	img {
		padding: 5px;
		margin: 15px;
	}
	
	div.img {
		float: right;
		margin: 10px;
		margin-right: 0px;
		border: 1px solid black;
	}
	div.img p {
		text-align: center;
	}
	div.img img {
		margin: 0px;
	}
	
	div.ficsor {
		border: 1px solid red;
		width: 500px;
		float: right;
		margin: 30px;
		padding: 10px;
	}
	
	b.main_functions {
		font-size: 20px;
		font-weight: bolder;
		color: #038;
	}
	
	ul {
		list-style-type: square;
	}

	ul ul {
		list-style-type: disc;
	}
	ul ul ul {
		list-style-type: circle;
	}
	</style>
</HEAD>
<BODY>
<p><B>Történet</B></p>
<table border="1">
<tr>
	<td>Dátum</td>
	<td>Verzió</td>
	<td>Leírás</td>
	<td>Szerző</td>
</tr>
<tr>
	<td>2010.11.20.</td>
	<td>0.1</td>
	<td>Dokumentum alapjai</td>
	<td>Fibinger Ádám</td>
</tr>

</table>

<p>Dokumentum c&iacute;me: ANAL&Iacute;ZIS MODELL</p>

<p>&nbsp;</p>

<p align="center"><b>T&ouml;rt&eacute;net</b></p>

<p>&nbsp;</p>

<h4>Tartalomjegyz&eacute;k</h4>

<p>&nbsp;</p>

<p><a href="#_Toc130801945">1. Bevezet&eacute;s</a></p>

<p><a href="#_Toc130801946">2. Kezdeti oszt&aacute;lydiagram</a></p>

<p><a href="#_Toc130801947">2.1 Oszt&aacute;lydiagram</a></p>

<p><a href="#_Toc130801948">2.2 Oszt&aacute;lyok felsorol&aacute;sa</a></p>

<p><a href="#_Toc130801949">2.3. Alrendszerek</a></p>

<p><a href="#_Toc130801950">3. Az első alrendszer modellje</a></p>

<p><a href="#_Toc130801951">3.1 Statikus modell</a></p>

<p><a href="#_Toc130801952">3.1.1 Kapcsolatok pontos&iacute;t&aacute;sa</a></p>

<p><a href="#_Toc130801953">3.1.2 Attrib&uacute;tumok azonos&iacute;t&aacute;sa</a></p>

<p><a href="#_Toc130801954">3.1.3 B&aacute;zisoszt&aacute;lyok keres&eacute;se</a></p>

<p><a href="#_Toc130801955">3.2. Dinamikus modell</a></p>

<p><a href="#_Toc130801956">3.3. Funkcion&aacute;lis modell</a></p>

<p><a href="#_Toc130801957">3.4. Oper&aacute;ci&oacute;k azonos&iacute;t&aacute;sa</a></p>

<p><a href="#_Toc130801958">3.5 Az anal&iacute;zis modell oszt&aacute;lydiagramja.</a></p>

<p><a href="#_Toc130801959">3.6. Az anal&iacute;zis modell oszt&aacute;lyainak
list&aacute;ja.</a></p>

<p><a href="#_Toc130801960">3.6.1 Első oszt&aacute;ly neve</a></p>

<p><a href="#_Toc130801961">3.6.2. M&aacute;sodik oszt&aacute;ly neve.</a></p>

<p><a href="#_Toc130801962">X. Mell&eacute;kletek</a></p>

<p>&nbsp;</p>

<p>&nbsp;</p>

<h1>1. Bevezetés</h1>
<p>A projekt célkitűzése egy keresztplatformos fájlkezelő alkalmazás megvalósítása, mely a rendszerek által nyújtott 
fájlkezelési szolgáltatásokat egységesíti, esetleges operációs rendszer migrációnál megkímélve a felhasználót egy 
újabb fájlkezelő alkalmazás betanulásától.</p>

<P>Jelen dokumentum célja a VDManager szoftver strukturális felépítésének defininálása. A megközelítés minimalista, 
a rendelkezésre álló idő alatt felvázolt Vízió, SRS mintájára nem definiál minden lehetséges és szükséges funkciót,
mindössze a szoftver strukturális felépítésének leírását tartalmazza. A dokumentum egy vázat tartalmaz, mely 
továbbfejlesztéséhez iránymutatásokat ad. A dokumentum nem végleges, hatékony szoftver implementálására alkalmatlan
a hiányosságok miatt. A végleges verzió előreláthatólag nem lesz elérhető az egyetemi félév végére, de egy tökéletes
kiindulópont egy keresztplatformos fájlkezelő elkészítéséhez. (a szükséges finomítások elvégzése után)</P>

<p>A szoftver 0.1-es verziószámú bemutatópéldányának, a jelen dokumentumban meghatározott funkciók felét képesnek kell 
lennie kielégíteni. (GUI, Vezérlő logika alapjai, egy fájlkezelő réteg, mely a helyi fájlkezelésért felelős)</p>

<p>A részletes célokért lásd a vízió dokumentáció "A végtermék áttekintése" pontot, funkcióanalízisért az SRS dokumentum
vonatkozó pontjait.</p>

<p>Jelen dokumentum olvasóközönsége széles, így az alkalmazott szakkifejezések pontos definíciójáért lásd a mellékelt Szótár
dokumentumot. Mivel az alkalmazott kifejezések esetén, a szótár szerinti definíciót értelmezzük így javasolt a dokumentum
elolvasása előtt áttekinteni azt, az eltérő értelmezésből eredő félreértések elkerülése végett.</p>

<h1>2. Kezdeti osztálydiagram</h1>
<p>Az SRS dokumentáció alapján az alábbi funkciókat kell implementálnunk:</p>
<ul>
	<li>Fájl Másolása</li>
	<li>Fájl Törlése</li>
	<li>Fájl Áthelyezése</li>
	<li>Fájl Átnevezése</li>
	<li>A fenti műveletek soros végrehajtását biztosító Queue (várakozási sor)</li>
	<li>Fájl Megnyitása</li>
</ul>
<p>Ezen műveletek végzéséhez feltétlen szükséges egy fájl objektum, amely segítségével egyértelműen azonosítható az a fájl,
amelyen a műveletet a felhasználó definiálja.</p>
<p>Ezek alapján a feltétlenül szükséges osztályok:</p>
<ul>
	<li>Fájl objektum</li>
	<li>Várakozási sor</li>
	<li>Műveleteket tartalmazó osztályok</li>
</ul>
<p>Ezen felül, ezeket az objektumokat kezelő (adminisztráló) osztály a Vezérlő.</p>
<h2>2.1 Oszt&aacute;lydiagram, kezdeti osztályok felsorolása</h2>
	<h3>Vezérlés</h3>
<div class="img">
	<img src="control_1.png" alt="Osztálydiagram kiindulópont">
	<p class="img_bottom">Vezérlést megvalósító osztályok kiindulópontja</p>
</div>
<ul>
	<li>Fájl Objektum:
	<p>Egy konrkét fájlról tartalmaz információkat, amely segítségével egyértelműen azonosítható a konrkét fájl. Ezen felül a felhasználó
	számára (beállítások szerint) és a rendszer számára szükséges információkat tartalmazza a fájlról. (pld: protokoll, amin keresztül
	elérhető, elérési út, stb. Ezen osztály függvényeit használva jeleníti meg a felhasználói felület (az ábrán nincs feltüntetve) az
	adott fájl információit a felhasználó számára.</p>
	</li>
	<li>Törlés:
		<p>Tartalmazza a Törlendő Fájl Objektumot. A műveletet a Vezérlő végzi, jelen osztály csak a műveletben érintett objektumokat
		tárolja.</p>
	</li>
	<li>Másolás
		<p>Két objektumot tartalmaz: Cél és Forrás Fájlobjektum. A műveletet a Vezérlő végzi, jelen osztály csak a műveletben érintett 
		objektumokat tárolja.</p>
	</li>
	<li>Átnevezés
		<p>Két objektumot tartalmaz: Cél és Forrás Fájlobjektum. A műveletet a Vezérlő végzi, jelen osztály csak a műveletben érintett 
		objektumokat tárolja.</p>
	</li>
	<li>Áthelyezés
		<p>Két objektumot tartalmaz: Cél és Forrás Fájlobjektum. A műveletet a Vezérlő végzi, jelen osztály csak a műveletben érintett 
		objektumokat tárolja.</p>
	</li>
	<li>Végrehajtás
		<p>Tartalmazza a végrehajtandó fájl objektumot, illetve végrehajtáshoz szükséges információkat az Operációs Rendszertől amennyiben
		az operációs rendszer támogatja a fájltársításokat, úgy a fájl típusa alapján átadja a fájlobjektumot végrehajtásra (amennyiben
		a fájl a helyi fájlrendszeren található, vagy futtatható hálózaton keresztül is).
		</p>
	</li>
	<li>Queue, Várakozási sor
		<p>Azon műveleteket tartalmazza (Törlés, Másolás, Áthelyezés, stb.), melyeket sorosan (FIFO) kell végrehajtani.</p>
	</li>
	<li>Vezérlő
	<p>A Grafikus felületet és a tényleges fájlrendszert összekötő modul, mely a vezérlési logikáért felelős. Fogadja a grafikus felület
	felől érkező parancsokat, feldolgozza azokat, létrehozza a parancs alapján a művelet végrehajtásához szükséges objektumokat, azokon
	műveleteket végez. Létrehozza és összeköti a Fájl Objektumot a tényleges fájlkezelő objektummal.</p>
	</li>
</ul>
<h3>Felhasználói felület</h3>
<div class="img">
	<img src="gui_1.png" alt="Felhasználói felület kezdeti osztályai">
	<p class="img_bottom">Felhasználói felület kezdeti osztályai</a>
</div>
<ul>
	<li>GUI vezérlő:
	<p>Tartja a kapcsolatot a Vezérlővel, és a Főablakban történő eseményeket kezeli, értelmezi (továbbítja ha szükséges), elemekkel
	tölti fel a panelokat, stb.</p>
	</li>
	<li>Főablak:
	<p>Azon vezérlő elemeket tartalmazza, mely a felhasználóval való kapcsolatartását biztosítja. Ezen helyezkednek el a vezérlőelemek, mint
	a Panelok és egyéb objektumok. Az általa kapott eseményeket továbbítja a GUI vezérlőnek.
	</p>
		<ul>
			<li>Panel:
			<p>A felhasználó által meghatározott elrendezésben jeleníti meg azokat az elemeket, melyeket a GUI vezérlő biztosított számára.
			</p>
			</li>
				<ul>
					<li>Panel elem:
					<p>Tartalmazza és megjeleníti azokat az információkat, melyeket az adott elemről (fájl objektum) a felhasználó látni kíván.</p>
					</li>
				</ul>
				<ul>
					<li>Panel vezérlő:
						<p>Tartalmazza az aktuális pontot, ahol a felhasználó "van" (URL formában megjelenítve), a felhasználó számára
						ugrási pontokat biztosít a partíciókhoz (meghajtó betűjelek vagy felcsatolási pontok), illetve tárolja az utolsó
						x pontot, ahol a felhasználó járt a beállításoknak megfelelően.
						</p>
					</li>
				</ul>
		</ul>
	</li>
</ul>



<h2><a name="_Toc101688616"></a><a name="_Toc101704477"></a><a name="_Toc130801949"></a>
2.3. Alrendszerek</h2>
<div class="img">
<img src="vdpackage.jpg" alt="Alrendszerek és kapcsolataik">
<p class="img_bottom">Alrendszerek és kapcsolataik</p>
</div>
<p>A szoftvernek három élesen elkülönülő része van:</p>
	<ol>
		<li>Vezérlés (VDControl)</li>
		<li>Felhasználói felület (VDGUI)</li>
		<li>Fájlkezelő (VDFileHandler)</li>
	</ol>

	<ul>
		<li>Vezérlés:</li>
		<p>A vezérlő rész felelős a felhasználó és a fájlrendszer által generált események kiértékeléséért és az eseményekhez
		tartozó funkciók implementálásáért. Ez a rendszer tartja nyilván a kezelendő objektumokat, adatokat, melyek
		a Fájl interfész segítségével egyértelműen azonosítható a Felhasználói felületen megjelenített fájl elem.</p>
		<li>Felhasználói felület:</li>
		<p>A felhasználóval való kapcsolattartásra szolgáló objektumcsoport. A felhasználó felé megjeleníti a vezérlőelemeket,
		értelmezi a felhasználó által végzett műveleteket, azokat továbbítja a vezérlő résznek további feldolgozásra, a vezérlő
		felől érkező eseményeket megjeleníti a felhasználónak. (folyamatjelző csíkok, Hiba üzenetek, stb.)
		</p>
		<li>"Fájl interfész"</li>
		<p>Realizálja a Vezérlő felől érkező parancsokat. Egy interfészen keresztül tartja a kapcsolatot a vezérlővel, a 
		fájlrendszeren bekövetkezett eseményeket továbbítja a vezérlő logika felé.</p>
	</ul>
<h3>Alrendszerek és távoli rendszerek kapcsolata</h3>
<div class="img">
<img src="system_overview.jpg" alt="Rendszer áttekintése">
<p>Alrendszerek kapcsolatainak áttekintése</p>
</div>
<p>A VDManager a távoli fájlszerverekkel az operációs rendszer által biztosított hálózati komponensek felhasználásával tartja a 
kapcsolatot.</p>



<p>&nbsp;</p>

<p>Ezut&aacute;n egy-egy alpontban, amelyek c&iacute;me "Alrendszern&eacute;v
alrendszer" (p&eacute;ld&aacute;ul "Vizsg&aacute;ztat&aacute;s alrendszer) form&aacute;j&uacute;
legyen, tartalmazza az egyes alrendszerek r&ouml;vid le&iacute;r&aacute;s&aacute;t, &eacute;s az
alrendszerhez tartoz&oacute; oszt&aacute;lyok neveinek felsorol&aacute;s&aacute;t.</p>

<p>&nbsp;</p>

<p><font color="#ff0000"><b>Figyelem! Ha eddig elk&eacute;sz&uuml;lt a dokumentum
(azaz az 1.0-&aacute;s verzi&oacute;ja), azt be kell mutatni a gyakorlatvezetőnek
(hat&aacute;ridőn bel&uuml;l), aki azt j&oacute;v&aacute;hagyja, vagy jav&iacute;t&aacute;sokat javasol.
Ez&aacute;ltal a tov&aacute;bbi (munkaig&eacute;nyes) l&eacute;p&eacute;seket egy olyan kiindul&aacute;si alap
felhaszn&aacute;l&aacute;s&aacute;val hajthatja v&eacute;gre a csoport, amely nem tartalmaz
koncepcion&aacute;lis hib&aacute;kat.</b></font></p>

<p>Ennek a dokumentumnak teh&aacute;t legal&aacute;bb k&eacute;t verzi&oacute;ja (egy r&ouml;videbb &eacute;s
egy teljes) fog elk&eacute;sz&uuml;lni a lead&aacute;si hat&aacute;ridőre.</p>

<p>&nbsp;</p>

<p><a name="_Toc101688617"></a>Ezut&aacute;n k&ouml;vetkeznek az egyes
alrendszerek modelljei, amiket a kiindul&aacute;si diagram pontos&iacute;t&aacute;s&aacute;val
nyerhet&uuml;nk. A dokumentum alrendszerenk&eacute;nt egy fejezetet tartalmaz, az
alrendszer nev&eacute;t tartalmaz&oacute; c&iacute;mmel. Minden alrendszerre el kell
v&eacute;gezni &eacute;s dokument&aacute;lni kell az al&aacute;bbi tev&eacute;kenys&eacute;geket.</p>

<p>&nbsp;</p>

<h1><a name="_Toc101183570"></a><a name="_Toc101688618"></a><a name="_Toc101704478"></a><a name="_Toc130801950"></a>
3. Az első alrendszer modellje</h1>

<p>&nbsp;</p>

<h2><a name="_Toc101688619"></a><a name="_Toc101704479"></a><a name="_Toc130801951"></a>
3.1 Statikus modell</h2>

<p>&nbsp;</p>

<h3><a name="_Toc101704480"></a><a name="_Toc130801952"></a>3.1.1
Kapcsolatok pontos&iacute;t&aacute;sa</h3>

<p>Valamennyi eddig felfedezett kapcsolatot megvizsg&aacute;lunk,
neves&iacute;tj&uuml;k, meg&aacute;llap&iacute;tjuk a szerepk&ouml;r&ouml;ket &eacute;s sz&aacute;moss&aacute;gokat. Ne
feledj&uuml;k, hogy a kapcsolatok pontos&iacute;t&aacute;sa &uacute;j oszt&aacute;lyok defini&aacute;l&aacute;s&aacute;hoz
is vezethet. (L&aacute;sd p&eacute;ld&aacute;ul az OMT esettanulm&aacute;ny c&iacute;mű seg&eacute;dletben a
torn&aacute;sz &eacute;s a szer kapcsolata.)</p>

<p>V&aacute;zoljuk azokat a meggondol&aacute;sokat, amelyek az oszt&aacute;lydiagram
pontos&iacute;t&aacute;s&aacute;hoz vezetnek, &eacute;s le&iacute;rjuk, hogy mit v&aacute;ltoztat az eddigi
inform&aacute;ci&oacute;kon.</p>

<p>&nbsp;</p>

<h3><a name="_Toc101183572"></a><a name="_Toc101704481"></a><a name="_Toc130801953"></a>
3.1.2 Attrib&uacute;tumok azonos&iacute;t&aacute;sa</h3>

<p>Minden oszt&aacute;lyhoz (vagy kapcsolathoz, ha ahhoz tartozik)
hozz&aacute;rendelj&uuml;k a legfontosabb attrib&uacute;tumait. Ez az elemz&eacute;s is
vezethet &uacute;j oszt&aacute;lyok felfedez&eacute;s&eacute;hez.&nbsp; (P&eacute;ld&aacute;ul az OMT
esettanulm&aacute;ny c&iacute;mű seg&eacute;dletben a torn&aacute;sz &eacute;s az egyes&uuml;let
kapcsolat&aacute;nak elemz&eacute;se.)</p>

<p><a name="_Toc101183573"></a>V&aacute;zoljuk azokat a meggondol&aacute;sokat,
amelyek az oszt&aacute;lydiagram pontos&iacute;t&aacute;s&aacute;hoz vezetnek, &eacute;s le&iacute;rjuk, hogy
mit v&aacute;ltoztat az eddigi inform&aacute;ci&oacute;kon. 
</p>

<p>&nbsp;</p>

<h3><a name="_Toc101704482"></a><a name="_Toc130801954"></a>3.1.3
B&aacute;zisoszt&aacute;lyok keres&eacute;se</h3>

<p>Megvizsg&aacute;land&oacute;, hogy vannak-e olyan esetek, ahol az egyes
oszt&aacute;lyokban ism&eacute;tlődő argumentumok egy k&ouml;z&ouml;s b&aacute;zisoszt&aacute;lyba
emelhetők ki. Ha tal&aacute;lunk ilyeneket, az &aacute;ltal&aacute;nos&iacute;t&aacute;s kapcsolatokkal
kieg&eacute;sz&iacute;tj&uuml;k az oszt&aacute;lydiagramot.</p>

<p>V&aacute;zoljuk azokat a meggondol&aacute;sokat, amelyek az oszt&aacute;lydiagram
pontos&iacute;t&aacute;s&aacute;hoz vezetnek, &eacute;s le&iacute;rjuk, hogy mit v&aacute;ltoztat az eddigi
inform&aacute;ci&oacute;kon. 
</p>

<p>&nbsp;</p>

<p>Az &iacute;gy pontos&iacute;tott oszt&aacute;lydiagram egy &aacute;tmeneti munkaanyag, amely a
dokumentum mell&eacute;klet&eacute;be ker&uuml;lhet (hivatkoz&aacute;ssal!), de nem k&ouml;telező
r&eacute;sze a dokumentumnak.</p>

<p>&nbsp;</p>

<h2><a name="_Toc101183576"></a><a name="_Toc101688620"></a><a name="_Toc101704483"></a><a name="_Toc130801955"></a>
3.2. Dinamikus modell</h2>

<p>&nbsp;</p>

<p>Egy-egy alpontban az SRS-ből &aacute;tvett haszn&aacute;lati esetek szok&aacute;sos
műk&ouml;d&eacute;si eseteire elk&eacute;sz&iacute;tj&uuml;k a sz&uuml;ks&eacute;ges diagrammokat. A haszn&aacute;lati
esetre a nev&eacute;vel hivatkozunk.</p>

<p>Ebben az alpontokban dokument&aacute;ljuk a sz&uuml;ks&eacute;ges &aacute;llapotdiagramokat
is. Az &aacute;llapotdiagramok &aacute;bra al&aacute;&iacute;r&aacute;s&aacute;ban szerepeljen a vonatkoz&oacute;
oszt&aacute;ly neve.</p>

<p>Ha az &aacute;ttekinthetős&eacute;get jav&iacute;tja, az alpont tov&aacute;bbi alpontokra
tagolhat&oacute;.</p>

<h2><a name="_Toc101183577"></a><a name="_Toc101688621"></a><a name="_Toc101704484"></a><a name="_Toc130801956"></a>
3.3. Funkcion&aacute;lis modell</h2>

<p>Egy &ndash; egy alpontban dokument&aacute;ljuk
le&iacute;r&aacute;ssal vagy a sz&uuml;ks&eacute;ges
diagrammokkal a rendszerben zajl&oacute; legfontosabb
feldolgoz&aacute;si
l&eacute;p&eacute;seket, az egyes tev&eacute;kenys&eacute;gek
k&ouml;z&ouml;tt sz&uuml;ks&eacute;ges adat &aacute;raml&aacute;sokat.</p>

<p>Ha az &aacute;ttekinthetős&eacute;get jav&iacute;tja, az alpont tov&aacute;bbi alpontokra
tagolhat&oacute;.</p>

<h2><a name="_Toc101183578"></a><a name="_Toc101688622"></a><a name="_Toc101704485"></a><a name="_Toc130801957"></a>
3.4. Oper&aacute;ci&oacute;k azonos&iacute;t&aacute;sa</h2>

<p>A dinamikus &eacute;s funkcion&aacute;lis modell felhaszn&aacute;l&aacute;s&aacute;val az
oszt&aacute;lydiagramot kieg&eacute;sz&iacute;tj&uuml;k az egyes oszt&aacute;lyokhoz tartoz&oacute;
oper&aacute;ci&oacute;kkal. Ek&ouml;zben &uacute;jabb oszt&aacute;lyok, kapcsolatok &eacute;s attrib&uacute;tumok
sz&uuml;ks&eacute;gess&eacute;g&eacute;re is f&eacute;ny der&uuml;lhet.</p>

<p>Ha sz&uuml;ks&eacute;ges, dokument&aacute;ljuk azokat a meggondol&aacute;sokat &eacute;s
d&ouml;nt&eacute;seket, amelyek az oszt&aacute;lydiagram kialak&iacute;t&aacute;s&aacute;hoz vezettek.</p>

<p>Ha az &aacute;ttekinthetős&eacute;get jav&iacute;tja, az alpont tov&aacute;bbi alpontokra
tagolhat&oacute;.</p>

<h2><a name="_Toc101704486"></a><a name="_Toc130801958"></a>3.5 Az
anal&iacute;zis modell oszt&aacute;lydiagramja</h2>

<p>A dinamikus &eacute;s funkcion&aacute;lis modell felhaszn&aacute;l&aacute;s&aacute;val az
oszt&aacute;lydiagramot kieg&eacute;sz&iacute;tj&uuml;k az egyes oszt&aacute;lyokhoz tartoz&oacute;
oper&aacute;ci&oacute;kkal. Ek&ouml;zben &uacute;jabb oszt&aacute;lyok, kapcsolatok &eacute;s attrib&uacute;tumok
sz&uuml;ks&eacute;gess&eacute;g&eacute;re is f&eacute;ny der&uuml;lhet.</p>

<p>Az &iacute;gy kieg&eacute;sz&iacute;tett oszt&aacute;lydiagramot sz&uacute;rjuk ide be. Ha olyan
m&eacute;retű, hogy kb. f&eacute;l oldalasra m&eacute;retezve nem olvashat&oacute;, teljes
oldalra kell m&eacute;retezni &eacute;s mell&eacute;kletbe tenni. Itt akkor csak egy
hivatkoz&aacute;s &aacute;ll.</p>

<p>A diagram term&eacute;szetesen tartalmaz olyan kapcsolatokat is, amely
egy m&aacute;sik alrendszer oszt&aacute;ly&aacute;hoz mutat. Ilyenkor a k&uuml;lső oszt&aacute;lynak
is kell szerepelnie az &aacute;br&aacute;n, de a le&iacute;r&aacute;sa nem itt, hanem az adott
alrendszern&eacute;l szerepel.</p>

<p>Egy p&eacute;lda az alrendszer oszt&aacute;lydiagramj&aacute;nak form&aacute;j&aacute;ra:</p>

<p><br>
<br>

</p>

<p><img src="AnalizisModell_html.jpg" name="K&eacute;p1" align="bottom" border="0" height="322" width="748"></p>

<p align="center">1. &aacute;bra 1</p>

<p>&nbsp;</p>

<h2><a name="_Toc101183580"></a><a name="_Toc101688624"></a><a name="_Toc101704487"></a><a name="_Toc130801959"></a>
3.6. Az anal&iacute;zis modell oszt&aacute;lyainak list&aacute;ja</h2>

<p>A előző pontban szereplő oszt&aacute;lydiagram oszt&aacute;lyainak le&iacute;r&aacute;sa.
Minden oszt&aacute;ly le&iacute;r&aacute;s&aacute;t kieg&eacute;sz&iacute;tj&uuml;k az attrib&uacute;tumokkal &eacute;s az
oper&aacute;ci&oacute;kkal. &Iacute;gy egy alpont az al&aacute;bbi form&aacute;j&uacute; lesz:</p>

<p>&nbsp;</p>

<h3><a name="_Toc101183581"></a><a name="_Toc101688625"></a><a name="_Toc101704488"></a><a name="_Toc130801960"></a>
3.6.1 Első oszt&aacute;ly neve</h3>

<p>&nbsp;</p>

<ul type="disc">

	<li>
    <p style="margin-bottom: 0cm;"><b>felelőss&eacute;ge, feladata:</b>
	le&iacute;rjuk egy-k&eacute;t mondatban az oszt&aacute;ly defin&iacute;ci&oacute;j&aacute;t, milyen
	felelőss&eacute;get rendelhet&uuml;nk hozz&aacute; az alkalmaz&aacute;son bel&uuml;l. 
	</p>

	</li>
  <li>
    <p style="margin-bottom: 0cm;"><b>egy&uuml;ttműk&ouml;dők:</b> felsoroljuk
	valamennyi olyan oszt&aacute;ly nev&eacute;t, amellyel az adott oszt&aacute;lynak egy&uuml;tt
	kell műk&ouml;dnie. 
	</p>

	</li>
  <li>
    <p><b>attrib&uacute;tumok</b> 
	</p>

  </li>
</ul>

<table border="1" cellpadding="0" cellspacing="0">

	<tbody>
    <tr valign="top">

		<td width="67">
			
      <h4>N&eacute;v</h4>

		</td>

		<td width="120">
			
      <p><b>T&iacute;pus</b></p>

		</td>

		<td width="384">
			
      <p><b>Le&iacute;r&aacute;s</b></p>

		</td>

	</tr>

	<tr valign="top">

		<td width="67">
			
      <p>&nbsp;</p>

		</td>

		<td width="120">
			
      <p>&nbsp;</p>

		</td>

		<td width="384">
			
      <p>&nbsp;</p>

		</td>

	</tr>

	<tr valign="top">

		<td width="67">
			
      <p>&nbsp;</p>

		</td>

		<td width="120">
			
      <p>&nbsp;</p>

		</td>

		<td width="384">
			
      <p>&nbsp;</p>

		</td>

	</tr>

	<tr valign="top">

		<td width="67">
			
      <p>&nbsp;</p>

		</td>

		<td width="120">
			
      <p>&nbsp;</p>

		</td>

		<td width="384">
			
      <p>&nbsp;</p>

		</td>

	</tr>

  </tbody>
</table>

<p>Kit&ouml;lt&eacute;si &uacute;tmutat&oacute; (teh&aacute;t nem a form&aacute;tum r&eacute;sze): A t&iacute;pus m&eacute;g
hi&aacute;nyozhat, vagy lehet &aacute;ltal&aacute;nos (pl. sz&ouml;veg).</p>

<ul type="disc">

	<li>
    <p><b>oper&aacute;ci&oacute;k</b> 
	</p>

  </li>
</ul>

<table border="1" cellpadding="0" cellspacing="0">

	<tbody>
    <tr valign="top">

		<td width="67">
			
      <h4>N&eacute;v</h4>

		</td>

		<td width="124">
			
      <p><b>Argumentumok</b></p>

		</td>

		<td width="381">
			
      <p><b>Műk&ouml;d&eacute;se, feladata</b></p>

		</td>

	</tr>

	<tr valign="top">

		<td width="67">
			
      <p>&nbsp;</p>

		</td>

		<td width="124">
			
      <p>&nbsp;</p>

		</td>

		<td width="381">
			
      <p>&nbsp;</p>

		</td>

	</tr>

	<tr valign="top">

		<td width="67">
			
      <p>&nbsp;</p>

		</td>

		<td width="124">
			
      <p>&nbsp;</p>

		</td>

		<td width="381">
			
      <p>&nbsp;</p>

		</td>

	</tr>

	<tr valign="top">

		<td width="67">
			
      <p>&nbsp;</p>

		</td>

		<td width="124">
			
      <p>&nbsp;</p>

		</td>

		<td width="381">
			
      <p>&nbsp;</p>

		</td>

	</tr>

  </tbody>
</table>

<p>Kit&ouml;lt&eacute;si &uacute;tmutat&oacute; (teh&aacute;t nem a form&aacute;tum r&eacute;sze): Az argumentum
lista m&eacute;g hi&aacute;nyozhat, vagy lehet, hogy nem teljes</p>

<p>&nbsp;</p>

<h3><a name="_Toc101183582"></a><a name="_Toc101688626"></a><a name="_Toc101704489"></a><a name="_Toc130801961"></a>
3.6.2. M&aacute;sodik oszt&aacute;ly neve</h3>

<p>&nbsp;</p>

<p>&nbsp;</p>

<p>stb.</p>

<p>&nbsp;</p>

<p>&nbsp;</p>

<p>&nbsp;</p>

<p>&nbsp;</p>

<p>A tov&aacute;bbiakban annyi fejezet sz&uuml;ks&eacute;ges, ah&aacute;ny alrendszerre
bontottuk az alkalmaz&aacute;st.</p>

<p>&nbsp;</p>

<p>&nbsp;</p>

<h1><a name="_Toc101183583"></a><a name="_Toc101688627"></a><a name="_Toc101704490"></a><a name="_Toc130801962"></a>
X. Mell&eacute;kletek</h1>

<p>Ide ker&uuml;lhetnek a sz&ouml;vegk&ouml;zi &aacute;br&aacute;nak t&uacute;l nagy oszt&aacute;lydiagramok, &eacute;s
minden m&aacute;s, ami a dokumentumot teljesebb&eacute; teheti.</p>

<p>&nbsp;</p>

<p>&nbsp;</p>

<p>&nbsp;</p>

</body>
</html>
